Конфигурация/Documents/ОсуществлениеПраваГолосаПоЦеннымБумагам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ОсуществлениеПраваГолосаПоЦеннымБумагам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГолосованияНаСобранияхВладельцевЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГолосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобранияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобранияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовесткаДня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыПовестки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВопросПовесткиДня</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантГолосования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыГолосования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ГолосованияНаСобранияхВладельцевЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГолосованияНаСобранияхВладельцевЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПовесткаДня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВопросПовесткиДня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПозицияПоВопросу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантГолосования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыГолосования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаГолосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСобранияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСобранияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ОсуществлениеПраваГолосаПоЦеннымБумагам/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Клиенты.Количество() = 0 Или ВопросыПовестки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПериодДвижения = ?(ЗначениеЗаполнено(ДатаГолосования), ДатаГолосования, Дата);

	Движения.ГолосованияНаСобранияхВладельцевЦенныхБумаг.Записывать = Истина;

	Для Каждого СтрокаКлиент Из Клиенты Цикл

		Для Каждого СтрокаВопрос Из ВопросыПовестки Цикл

			Движение = Движения.ГолосованияНаСобранияхВладельцевЦенныхБумаг.Добавить();
			Движение.Период                    = ПериодДвижения;
			Движение.Организация               = Организация;
			Движение.СчетДоверительногоУправления = СтрокаКлиент.СчетДоверительногоУправления;
			Движение.ЦеннаяБумага              = ЦеннаяБумага;
			Движение.ПовесткаДня               = ПовесткаДня;
			Движение.ВопросПовесткиДня         = СтрокаВопрос.ВопросПовесткиДня;
			Движение.ВариантГолосования        = СтрокаВопрос.ВариантГолосования;
			Движение.ПозицияПоВопросу          = Строка(СтрокаВопрос.ВариантГолосования);
			Движение.ДатаГолосования           = ДатаГолосования;
			Движение.ДатаСобранияНачало        = ДатаСобранияНачало;
			Движение.ДатаСобранияОкончание     = ДатаСобранияОкончание;

		КонецЦикла;

	КонецЦикла;

	ПредупредитьОДубляхГолосований();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Клиенты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не заполнен список клиентов (счетов ДУ)",, "Клиенты",, Отказ);
	КонецЕсли;

	Если ВопросыПовестки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не заполнен список вопросов повестки дня и вариантов голосования",, "ВопросыПовестки",, Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выводит предупреждение (без отказа), если по портфелю уже заведен документ голосования
// по этой же ценной бумаге и собранию. Служит для контроля дублей.
Процедура ПредупредитьОДубляхГолосований()

	Если Клиенты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивСчетов = Клиенты.ВыгрузитьКолонку("СчетДоверительногоУправления");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Голосования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Голосования.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ГолосованияНаСобранияхВладельцевЦенныхБумаг КАК Голосования
		|ГДЕ
		|	Голосования.Организация = &Организация
		|	И Голосования.ЦеннаяБумага = &ЦеннаяБумага
		|	И Голосования.ДатаСобранияНачало = &ДатаСобранияНачало
		|	И Голосования.Регистратор <> &Регистратор
		|	И Голосования.СчетДоверительногоУправления В (&МассивСчетов)";

	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ЦеннаяБумага",        ЦеннаяБумага);
	Запрос.УстановитьПараметр("ДатаСобранияНачало",  ДатаСобранияНачало);
	Запрос.УстановитьПараметр("Регистратор",         Ссылка);
	Запрос.УстановитьПараметр("МассивСчетов",        МассивСчетов);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Внимание! По портфелю """ + Строка(Выборка.СчетДоверительногоУправления)
			+ """ уже заведен документ голосования по данной ценной бумаге и собранию: "
			+ Строка(Выборка.Регистратор));
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
